balazsgrill/modembed/pic/core/hu.modembed.pic.ui/device-descriptors/18xxxx/PIC18F6490.PIC
<?xml version="1.0" ?><edc:PIC edc:arch="18xxxx" edc:desc="" edc:informedby="DOS PS DS" edc:isextended="true" edc:name="PIC18F6490" edc:procid="0x6490" xmlns:edc="http://crownking/edc" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd">
  <edc:Power>
    <edc:VPP edc:defaultvoltage="11.000" edc:maxvoltage="12.000" edc:minvoltage="10.000"/>
    <edc:VDD edc:maxdefaultvoltage="5.500" edc:maxvoltage="5.500" edc:mindefaultvoltage="4.250" edc:minvoltage="2.125" edc:nominalvoltage="5.000"/>
  </edc:Power>
  <edc:Programming edc:lvpthresh="2.750" edc:memtech="ee" edc:panelsize="0x0" edc:tries="1">
    <edc:Wait edc:cfg="5000" edc:eedata="4000" edc:erase="30000" edc:lverase="2000" edc:lvpgm="2000" edc:pgm="2000" edc:userid="5000"/>
    <edc:Latches edc:cfg="2" edc:eedata="2" edc:pgm="16" edc:rowerase="0" edc:userid="8"/>
  </edc:Programming>
  <edc:ArchDef edc:desc="18xxxx" edc:name="18xxxx">
    <edc:MemTraits edc:bankcount="16" edc:hwstackdepth="31">
      <edc:CodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:ExtCodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:BackgroundDebugMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:TestMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:UserIDMemTraits edc:locsize="0x1" edc:wordimpl="0xf" edc:wordinit="0xff" edc:wordsafe="0xf" edc:wordsize="0x1"/>
      <edc:ConfigFuseMemTraits edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0xff" edc:wordsafe="0xff" edc:wordsize="0x1"/>
      <edc:ConfigWORMMemTraits edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0xff" edc:wordsafe="0xff" edc:wordsize="0x1"/>
      <edc:DeviceIDMemTraits edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0xff" edc:wordsafe="0xff" edc:wordsize="0x1"/>
      <edc:EEDataMemTraits edc:magicoffset="0xf00000"/>
      <edc:DataMemTraits edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0x0" edc:wordsafe="0xff" edc:wordsize="0x1"/>
    </edc:MemTraits>
  </edc:ArchDef>
  <edc:MemoryModeList edc:addr="0x300004">
    <edc:MicrocontrollerMode edc:id="microctrl"/>
  </edc:MemoryModeList>
  <edc:Oscillator>
    <edc:OscillatorMode edc:id="0" edc:max="4000000" edc:min="32000"/>
    <edc:OscillatorMode edc:id="1" edc:max="4000000" edc:min="32000"/>
    <edc:OscillatorMode edc:id="4" edc:max="4000000" edc:min="32000"/>
    <edc:OscillatorMode edc:id="5" edc:max="40000000" edc:min="16000000"/>
    <edc:OscillatorMode edc:id="6" edc:max="40000000" edc:min="32000"/>
    <edc:OscillatorMode edc:id="7" edc:max="40000000" edc:min="32000"/>
    <edc:OscillatorMode edc:id="8" edc:max="4000000" edc:min="32000"/>
    <edc:OscillatorMode edc:id="9" edc:max="20000000" edc:min="4000000"/>
    <edc:OscillatorMode edc:id="10" edc:max="4000000" edc:min="100000"/>
    <edc:OscillatorMode edc:id="11" edc:max="200000" edc:min="32000"/>
  </edc:Oscillator>
  <edc:WatchdogTimer edc:min="4"/>
  <edc:Breakpoints edc:hasdatacapture="false" edc:hwbpcount="0x3" edc:idbyte="p"/>
  <edc:LCD edc:segcount="0x80"/>
  <edc:ProgramSpace>
    <edc:CodeSector edc:beginaddr="0x0" edc:endaddr="0x4000" edc:regionid="page"/>
    <edc:ExtCodeSector edc:beginaddr="0x2000" edc:endaddr="0x200000" edc:regionid="extpgmmem"/>
    <edc:TestZone edc:beginaddr="0x200000" edc:endaddr="0x200040" edc:regionid="testmem"/>
    <edc:UserIDSector edc:beginaddr="0x200000" edc:endaddr="0x200008" edc:regionid="idlocs"/>
    <edc:ConfigFuseSector edc:beginaddr="0x300000" edc:endaddr="0x30000e" edc:regionid="config">
      <edc:AdjustPoint edc:offset="1"/>
      <edc:DCRDef edc:access="nn--nnnn" edc:cname="CONFIG1H" edc:default="0x7" edc:desc="" edc:impl="0xcf" edc:name="CONFIG1H" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xcf">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="OSC" edc:desc="Oscillator" edc:mask="0xf" edc:name="OSC" edc:nzwidth="0x4">
              <edc:DCRFieldSemantic edc:desc="11XX EXT RC-CLKOUT on RA6" edc:islanghidden="true" edc:oscmodeidref="0" edc:when="(field &amp; 0xc) == 0xc"/>
              <edc:DCRFieldSemantic edc:desc="101X EXT RC-CLKOUT on RA6" edc:islanghidden="true" edc:oscmodeidref="1" edc:when="(field &amp; 0xe) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="INTIO7" edc:desc="Internal oscillator block, CLKO function on RA6, port function on RA7" edc:when="(field &amp; 0xf) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="INTIO67" edc:desc="Internal oscillator block, port function on RA6 and RA7" edc:when="(field &amp; 0xf) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="RCIO" edc:desc="External RC oscillator, port function on RA6" edc:oscmodeidref="4" edc:when="(field &amp; 0xf) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="HSPLL" edc:desc="HS oscillator, PLL enabled (clock frequency = 4 x FOSC1)" edc:oscmodeidref="5" edc:when="(field &amp; 0xf) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="ECIO" edc:desc="EC oscillator, port function on RA6" edc:oscmodeidref="6" edc:when="(field &amp; 0xf) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="EC" edc:desc="EC oscillator, CLKO function on RA6" edc:oscmodeidref="7" edc:when="(field &amp; 0xf) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="RC" edc:desc="External RC oscillator, CLKO function on RA6" edc:oscmodeidref="8" edc:when="(field &amp; 0xf) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="HS" edc:desc="HS oscillator" edc:oscmodeidref="9" edc:when="(field &amp; 0xf) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="XT" edc:desc="XT oscillator" edc:oscmodeidref="10" edc:when="(field &amp; 0xf) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="LP" edc:desc="LP oscillator" edc:oscmodeidref="11" edc:when="(field &amp; 0xf) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:DCRFieldDef edc:cname="FCMEN" edc:desc="Fail-Safe Clock Monitor Enable" edc:mask="0x1" edc:name="FCMEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Fail-Safe Clock Monitor disabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Fail-Safe Clock Monitor enabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="IESO" edc:desc="Internal External Switch Over Mode" edc:mask="0x1" edc:name="IESO" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Oscillator Switchover mode disabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Oscillator Switchover mode enabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="---nnnnn" edc:cname="CONFIG2L" edc:default="0x1f" edc:desc="" edc:impl="0x1f" edc:name="CONFIG2L" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x1f">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="PWRT" edc:desc="Power Up Timer" edc:mask="0x1" edc:name="PWRT" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="PWRT disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="PWRT enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BOREN" edc:desc="Brown Out Detect" edc:mask="0x3" edc:name="BOREN" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="SBORDIS" edc:desc="Brown-out Reset enabled in hardware only (SBOREN is disabled)" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="NOSLP" edc:desc="Brown-out Reset enabled in hardware only and disabled in Sleep mode (SBOREN is disabled)" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Brown-out Reset enabled and controlled by software (SBOREN is enabled)" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Brown-out Reset disabled in hardware and software" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BORV" edc:desc="Brown Out Voltage" edc:mask="0x3" edc:name="BORV" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="3" edc:desc="VBOR set to 2.1V" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="2" edc:desc="VBOR set to 2.8V" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="1" edc:desc="VBOR set to 4.3V" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="0" edc:desc="VBOR set to 4.6V" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="---nnnnn" edc:cname="CONFIG2H" edc:default="0x1f" edc:desc="" edc:impl="0x1f" edc:name="CONFIG2H" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x1f">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="WDT" edc:desc="Watchdog Timer" edc:mask="0x1" edc:name="WDT" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="WDT enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="WDT disabled (control is placed on the SWDTEN bit)" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDTPS" edc:desc="Watchdog Postscaler" edc:mask="0xf" edc:name="WDTPS" edc:nzwidth="0x4">
              <edc:DCRFieldSemantic edc:cname="32768" edc:desc="1:32768" edc:when="(field &amp; 0xf) == 0xf"/>
              <edc:DCRFieldSemantic edc:cname="16384" edc:desc="1:16384" edc:when="(field &amp; 0xf) == 0xe"/>
              <edc:DCRFieldSemantic edc:cname="8192" edc:desc="1:8192" edc:when="(field &amp; 0xf) == 0xd"/>
              <edc:DCRFieldSemantic edc:cname="4096" edc:desc="1:4096" edc:when="(field &amp; 0xf) == 0xc"/>
              <edc:DCRFieldSemantic edc:cname="2048" edc:desc="1:2048" edc:when="(field &amp; 0xf) == 0xb"/>
              <edc:DCRFieldSemantic edc:cname="1024" edc:desc="1:1024" edc:when="(field &amp; 0xf) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="512" edc:desc="1:512" edc:when="(field &amp; 0xf) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="256" edc:desc="1:256" edc:when="(field &amp; 0xf) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="128" edc:desc="1:128" edc:when="(field &amp; 0xf) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="64" edc:desc="1:64" edc:when="(field &amp; 0xf) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="32" edc:desc="1:32" edc:when="(field &amp; 0xf) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="16" edc:desc="1:16" edc:when="(field &amp; 0xf) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="8" edc:desc="1:8" edc:when="(field &amp; 0xf) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="4" edc:desc="1:4" edc:when="(field &amp; 0xf) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="2" edc:desc="1:2" edc:when="(field &amp; 0xf) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="1" edc:desc="1:1" edc:when="(field &amp; 0xf) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nn----nn" edc:cname="CONFIG3L" edc:default="0xff" edc:desc="" edc:impl="0xc3" edc:islanghidden="true" edc:name="CONFIG3L" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xc3">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="RESERVED" edc:desc="RESERVED" edc:ishidden="true" edc:mask="0x3" edc:name="RESERVED" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:desc="Maintain bits as 1s." edc:memmodeidref="microctrl" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:DCRFieldDef edc:cname="RES" edc:desc="RESERVED" edc:ishidden="true" edc:mask="0x3" edc:name="RES" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:desc="Maintain bits as 1s." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="n----n-n" edc:cname="CONFIG3H" edc:default="0x81" edc:desc="" edc:impl="0x85" edc:name="CONFIG3H" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x85">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="CCP2MX" edc:desc="CCP2 Mux" edc:mask="0x1" edc:name="CCP2MX" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="PORTC" edc:desc="CCP2 input/output is multiplexed with RC1" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PORTBE" edc:desc="CCP2 input/output is multiplexed with RE7" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="LPT1OSC" edc:desc="Low Power Timer1 Osc enable" edc:mask="0x1" edc:name="LPT1OSC" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Timer1 configured for low-power operation" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Timer1 configured for higher power operation" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:DCRFieldDef edc:cname="MCLRE" edc:desc="Master Clear Enable" edc:mask="0x1" edc:name="MCLRE" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="MCLR pin enabled; RG5 input pin disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="RG5 input pin enabled; MCLR disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nn-----n" edc:cname="CONFIG4L" edc:default="0x81" edc:desc="" edc:impl="0xc1" edc:name="CONFIG4L" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xc1">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="STVREN" edc:desc="Stack Overflow Reset" edc:mask="0x1" edc:name="STVREN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Stack full/underflow will cause Reset" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Stack full/underflow will not cause Reset" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:DCRFieldDef edc:cname="XINST" edc:desc="Extended Instruction Set Enable bit" edc:mask="0x1" edc:name="XINST" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Instruction set extension and Indexed Addressing mode enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Instruction set extension and Indexed Addressing mode disabled (Legacy mode)" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DEBUG" edc:desc="Background Debugger Enable bit" edc:isidehidden="true" edc:mask="0x1" edc:name="DEBUG" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Background debugger disabled, RB6 and RB7 configured as general purpose I/O pins" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Background debugger enabled, RB6 and RB7 are dedicated to In-Circuit Debug" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:AdjustPoint edc:offset="1"/>
      <edc:DCRDef edc:access="-------n" edc:cname="CONFIG5L" edc:default="0x1" edc:desc="" edc:impl="0x1" edc:name="CONFIG5L" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x1">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="CP" edc:desc="Code Protect 00000-03FFF" edc:mask="0x1" edc:name="CP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Program memory block (000000-003FFFh) not code-protected" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Program memory block (000000-003FFFh) code-protected" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x27" edc:endaddr="0x4000"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
