balazsgrill/modembed/pic/core/hu.modembed.pic.ui/device-descriptors/18xxxx/PIC18F6490.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDSE1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="LCDSE1" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDSE1" edc:desc="" edc:mask="0xff" edc:name="LCDSE1" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SE8" edc:desc="" edc:mask="0x1" edc:name="SE8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE9" edc:desc="" edc:mask="0x1" edc:name="SE9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE10" edc:desc="" edc:mask="0x1" edc:name="SE10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE11" edc:desc="" edc:mask="0x1" edc:name="SE11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE12" edc:desc="" edc:mask="0x1" edc:name="SE12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE13" edc:desc="" edc:mask="0x1" edc:name="SE13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE14" edc:desc="" edc:mask="0x1" edc:name="SE14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE15" edc:desc="" edc:mask="0x1" edc:name="SE15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEGEN8" edc:desc="" edc:mask="0x1" edc:name="SEGEN8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN9" edc:desc="" edc:mask="0x1" edc:name="SEGEN9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN10" edc:desc="" edc:mask="0x1" edc:name="SEGEN10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN11" edc:desc="" edc:mask="0x1" edc:name="SEGEN11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN12" edc:desc="" edc:mask="0x1" edc:name="SEGEN12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN13" edc:desc="" edc:mask="0x1" edc:name="SEGEN13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN14" edc:desc="" edc:mask="0x1" edc:name="SEGEN14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN15" edc:desc="" edc:mask="0x1" edc:name="SEGEN15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDSE2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="LCDSE2" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDSE2" edc:desc="" edc:mask="0xff" edc:name="LCDSE2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SE16" edc:desc="" edc:mask="0x1" edc:name="SE16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE17" edc:desc="" edc:mask="0x1" edc:name="SE17" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE18" edc:desc="" edc:mask="0x1" edc:name="SE18" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE19" edc:desc="" edc:mask="0x1" edc:name="SE19" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE20" edc:desc="" edc:mask="0x1" edc:name="SE20" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE21" edc:desc="" edc:mask="0x1" edc:name="SE21" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE22" edc:desc="" edc:mask="0x1" edc:name="SE22" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE23" edc:desc="" edc:mask="0x1" edc:name="SE23" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEGEN16" edc:desc="" edc:mask="0x1" edc:name="SEGEN16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN17" edc:desc="" edc:mask="0x1" edc:name="SEGEN17" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN18" edc:desc="" edc:mask="0x1" edc:name="SEGEN18" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN19" edc:desc="" edc:mask="0x1" edc:name="SEGEN19" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN20" edc:desc="" edc:mask="0x1" edc:name="SEGEN20" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN21" edc:desc="" edc:mask="0x1" edc:name="SEGEN21" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN22" edc:desc="" edc:mask="0x1" edc:name="SEGEN22" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN23" edc:desc="" edc:mask="0x1" edc:name="SEGEN23" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDSE3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="LCDSE3" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDSE3" edc:desc="" edc:mask="0xff" edc:name="LCDSE3" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SE24" edc:desc="" edc:mask="0x1" edc:name="SE24" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE25" edc:desc="" edc:mask="0x1" edc:name="SE25" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE26" edc:desc="" edc:mask="0x1" edc:name="SE26" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE27" edc:desc="" edc:mask="0x1" edc:name="SE27" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE28" edc:desc="" edc:mask="0x1" edc:name="SE28" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE29" edc:desc="" edc:mask="0x1" edc:name="SE29" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE30" edc:desc="" edc:mask="0x1" edc:name="SE30" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE31" edc:desc="" edc:mask="0x1" edc:name="SE31" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEGEN24" edc:desc="" edc:mask="0x1" edc:name="SEGEN24" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN25" edc:desc="" edc:mask="0x1" edc:name="SEGEN25" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN26" edc:desc="" edc:mask="0x1" edc:name="SEGEN26" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN27" edc:desc="" edc:mask="0x1" edc:name="SEGEN27" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN28" edc:desc="" edc:mask="0x1" edc:name="SEGEN28" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN29" edc:desc="" edc:mask="0x1" edc:name="SEGEN29" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN30" edc:desc="" edc:mask="0x1" edc:name="SEGEN30" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEGEN31" edc:desc="" edc:mask="0x1" edc:name="SEGEN31" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="0xf" edc:beginaddr="0xf60" edc:endaddr="0x1000" edc:regionid="accesssfr">
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA0" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA0" edc:desc="" edc:mask="0xff" edc:name="LCDDATA0" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S0C0" edc:desc="" edc:mask="0x1" edc:name="S0C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S1C0" edc:desc="" edc:mask="0x1" edc:name="S1C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S2C0" edc:desc="" edc:mask="0x1" edc:name="S2C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S3C0" edc:desc="" edc:mask="0x1" edc:name="S3C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S4C0" edc:desc="" edc:mask="0x1" edc:name="S4C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S5C0" edc:desc="" edc:mask="0x1" edc:name="S5C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S6C0" edc:desc="" edc:mask="0x1" edc:name="S6C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S7C0" edc:desc="" edc:mask="0x1" edc:name="S7C0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG0COM0" edc:desc="" edc:mask="0x1" edc:name="SEG0COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG1COM0" edc:desc="" edc:mask="0x1" edc:name="SEG1COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG2COM0" edc:desc="" edc:mask="0x1" edc:name="SEG2COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG3COM0" edc:desc="" edc:mask="0x1" edc:name="SEG3COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG4COM0" edc:desc="" edc:mask="0x1" edc:name="SEG4COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG5COM0" edc:desc="" edc:mask="0x1" edc:name="SEG5COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG6COM0" edc:desc="" edc:mask="0x1" edc:name="SEG6COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG7COM0" edc:desc="" edc:mask="0x1" edc:name="SEG7COM0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="S00C0" edc:desc="" edc:mask="0x1" edc:name="S00C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S01C0" edc:desc="" edc:mask="0x1" edc:name="S01C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S02C0" edc:desc="" edc:mask="0x1" edc:name="S02C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S03C0" edc:desc="" edc:mask="0x1" edc:name="S03C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S04C0" edc:desc="" edc:mask="0x1" edc:name="S04C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S05C0" edc:desc="" edc:mask="0x1" edc:name="S05C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S06C0" edc:desc="" edc:mask="0x1" edc:name="S06C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S07C0" edc:desc="" edc:mask="0x1" edc:name="S07C0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA1" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA1" edc:desc="" edc:mask="0xff" edc:name="LCDDATA1" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S8C0" edc:desc="" edc:mask="0x1" edc:name="S8C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S9C0" edc:desc="" edc:mask="0x1" edc:name="S9C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S10C0" edc:desc="" edc:mask="0x1" edc:name="S10C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S11C0" edc:desc="" edc:mask="0x1" edc:name="S11C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S12C0" edc:desc="" edc:mask="0x1" edc:name="S12C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S13C0" edc:desc="" edc:mask="0x1" edc:name="S13C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S14C0" edc:desc="" edc:mask="0x1" edc:name="S14C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S15C0" edc:desc="" edc:mask="0x1" edc:name="S15C0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG8COM0" edc:desc="" edc:mask="0x1" edc:name="SEG8COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG9COM0" edc:desc="" edc:mask="0x1" edc:name="SEG9COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG10COM0" edc:desc="" edc:mask="0x1" edc:name="SEG10COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG11COM0" edc:desc="" edc:mask="0x1" edc:name="SEG11COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG12COM0" edc:desc="" edc:mask="0x1" edc:name="SEG12COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG13COM0" edc:desc="" edc:mask="0x1" edc:name="SEG13COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG14COM0" edc:desc="" edc:mask="0x1" edc:name="SEG14COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG15COM0" edc:desc="" edc:mask="0x1" edc:name="SEG15COM0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="S08C0" edc:desc="" edc:mask="0x1" edc:name="S08C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S09C0" edc:desc="" edc:mask="0x1" edc:name="S09C0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA2" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA2" edc:desc="" edc:mask="0xff" edc:name="LCDDATA2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S16C0" edc:desc="" edc:mask="0x1" edc:name="S16C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S17C0" edc:desc="" edc:mask="0x1" edc:name="S17C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S18C0" edc:desc="" edc:mask="0x1" edc:name="S18C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S19C0" edc:desc="" edc:mask="0x1" edc:name="S19C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S20C0" edc:desc="" edc:mask="0x1" edc:name="S20C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S21C0" edc:desc="" edc:mask="0x1" edc:name="S21C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S22C0" edc:desc="" edc:mask="0x1" edc:name="S22C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S23C0" edc:desc="" edc:mask="0x1" edc:name="S23C0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG16COM0" edc:desc="" edc:mask="0x1" edc:name="SEG16COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG17COM0" edc:desc="" edc:mask="0x1" edc:name="SEG17COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG18COM0" edc:desc="" edc:mask="0x1" edc:name="SEG18COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG19COM0" edc:desc="" edc:mask="0x1" edc:name="SEG19COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG20COM0" edc:desc="" edc:mask="0x1" edc:name="SEG20COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG21COM0" edc:desc="" edc:mask="0x1" edc:name="SEG21COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG22COM0" edc:desc="" edc:mask="0x1" edc:name="SEG22COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG23COM0" edc:desc="" edc:mask="0x1" edc:name="SEG23COM0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA3" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA3" edc:desc="" edc:mask="0xff" edc:name="LCDDATA3" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S24C0" edc:desc="" edc:mask="0x1" edc:name="S24C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S25C0" edc:desc="" edc:mask="0x1" edc:name="S25C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S26C0" edc:desc="" edc:mask="0x1" edc:name="S26C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S27C0" edc:desc="" edc:mask="0x1" edc:name="S27C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S28C0" edc:desc="" edc:mask="0x1" edc:name="S28C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S29C0" edc:desc="" edc:mask="0x1" edc:name="S29C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S30C0" edc:desc="" edc:mask="0x1" edc:name="S30C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S31C0" edc:desc="" edc:mask="0x1" edc:name="S31C0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG24COM0" edc:desc="" edc:mask="0x1" edc:name="SEG24COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG25COM0" edc:desc="" edc:mask="0x1" edc:name="SEG25COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG26COM0" edc:desc="" edc:mask="0x1" edc:name="SEG26COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG27COM0" edc:desc="" edc:mask="0x1" edc:name="SEG27COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG28COM0" edc:desc="" edc:mask="0x1" edc:name="SEG28COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG29COM0" edc:desc="" edc:mask="0x1" edc:name="SEG29COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG30COM0" edc:desc="" edc:mask="0x1" edc:name="SEG30COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG31COM0" edc:desc="" edc:mask="0x1" edc:name="SEG31COM0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA4" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA4" edc:desc="" edc:mask="0xff" edc:name="LCDDATA4" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S32C0" edc:desc="" edc:mask="0x1" edc:name="S32C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S33C0" edc:desc="" edc:mask="0x1" edc:name="S33C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S34C0" edc:desc="" edc:mask="0x1" edc:name="S34C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S35C0" edc:desc="" edc:mask="0x1" edc:name="S35C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S36C0" edc:desc="" edc:mask="0x1" edc:name="S36C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S37C0" edc:desc="" edc:mask="0x1" edc:name="S37C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S38C0" edc:desc="" edc:mask="0x1" edc:name="S38C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S39C0" edc:desc="" edc:mask="0x1" edc:name="S39C0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG32COM0" edc:desc="" edc:mask="0x1" edc:name="SEG32COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG33COM0" edc:desc="" edc:mask="0x1" edc:name="SEG33COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG34COM0" edc:desc="" edc:mask="0x1" edc:name="SEG34COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG35COM0" edc:desc="" edc:mask="0x1" edc:name="SEG35COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG36COM0" edc:desc="" edc:mask="0x1" edc:name="SEG36COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG37COM0" edc:desc="" edc:mask="0x1" edc:name="SEG37COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG38COM0" edc:desc="" edc:mask="0x1" edc:name="SEG38COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG39COM0" edc:desc="" edc:mask="0x1" edc:name="SEG39COM0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
