balazsgrill/modembed/pic/core/hu.modembed.pic.ui/device-descriptors/18xxxx/PIC18F6490.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SPBRG2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SPBRG2" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPBRG2" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="SPBRG2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA11" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA11" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA11" edc:desc="" edc:mask="0xff" edc:name="LCDDATA11" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S40C1" edc:desc="" edc:mask="0x1" edc:name="S40C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S41C1" edc:desc="" edc:mask="0x1" edc:name="S41C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S42C1" edc:desc="" edc:mask="0x1" edc:name="S42C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S43C1" edc:desc="" edc:mask="0x1" edc:name="S43C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S44C1" edc:desc="" edc:mask="0x1" edc:name="S44C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S45C1" edc:desc="" edc:mask="0x1" edc:name="S45C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S46C1" edc:desc="" edc:mask="0x1" edc:name="S46C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S47C1" edc:desc="" edc:mask="0x1" edc:name="S47C1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG40COM1" edc:desc="" edc:mask="0x1" edc:name="SEG40COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG41COM1" edc:desc="" edc:mask="0x1" edc:name="SEG41COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG42COM1" edc:desc="" edc:mask="0x1" edc:name="SEG42COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG43COM1" edc:desc="" edc:mask="0x1" edc:name="SEG43COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG44COM1" edc:desc="" edc:mask="0x1" edc:name="SEG44COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG45COM1" edc:desc="" edc:mask="0x1" edc:name="SEG45COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG46COM1" edc:desc="" edc:mask="0x1" edc:name="SEG46COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG47COM1" edc:desc="" edc:mask="0x1" edc:name="SEG47COM1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA12" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA12" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA12" edc:desc="" edc:mask="0xff" edc:name="LCDDATA12" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S0C2" edc:desc="" edc:mask="0x1" edc:name="S0C2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S1C2" edc:desc="" edc:mask="0x1" edc:name="S1C2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S2C2" edc:desc="" edc:mask="0x1" edc:name="S2C2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S3C2" edc:desc="" edc:mask="0x1" edc:name="S3C2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S4C2" edc:desc="" edc:mask="0x1" edc:name="S4C2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S5C2" edc:desc="" edc:mask="0x1" edc:name="S5C2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S6C2" edc:desc="" edc:mask="0x1" edc:name="S6C2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S7C2" edc:desc="" edc:mask="0x1" edc:name="S7C2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG0COM2" edc:desc="" edc:mask="0x1" edc:name="SEG0COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG1COM2" edc:desc="" edc:mask="0x1" edc:name="SEG1COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG2COM2" edc:desc="" edc:mask="0x1" edc:name="SEG2COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG3COM2" edc:desc="" edc:mask="0x1" edc:name="SEG3COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG4COM2" edc:desc="" edc:mask="0x1" edc:name="SEG4COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG5COM2" edc:desc="" edc:mask="0x1" edc:name="SEG5COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG6COM2" edc:desc="" edc:mask="0x1" edc:name="SEG6COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG7COM2" edc:desc="" edc:mask="0x1" edc:name="SEG7COM2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="S00C2" edc:desc="" edc:mask="0x1" edc:name="S00C2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S01C2" edc:desc="" edc:mask="0x1" edc:name="S01C2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S02C2" edc:desc="" edc:mask="0x1" edc:name="S02C2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S03C2" edc:desc="" edc:mask="0x1" edc:name="S03C2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S04C2" edc:desc="" edc:mask="0x1" edc:name="S04C2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S05C2" edc:desc="" edc:mask="0x1" edc:name="S05C2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S06C2" edc:desc="" edc:mask="0x1" edc:name="S06C2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S07C2" edc:desc="" edc:mask="0x1" edc:name="S07C2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
